Revit 2027 API
ViewSection.IsSplitSection Method
 Sections can be split (jog) so that they cut at >1 plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSplitSection()
Public Function IsSplitSection As Boolean
public:
bool IsSplitSection()
member IsSplitSection : unit -> bool
Return Value
Boolean
 True if the section is split.
See Also
Reference
ViewSection Class
Autodesk.Revit.DB Namespace